In [2]:
import sqlite3
import pandas as pd

In [3]:
# Establecer la conexi√≥n
conexion = sqlite3.connect('Basedatosparte2.db')

# Crear un cursor para ejecutar comandos SQL
cursor = conexion.cursor()

In [4]:
tabla_proveedores = """
CREATE TABLE IF NOT EXISTS Proveedores (
    CodigoProveedor INT PRIMARY KEY,
    Nombre VARCHAR(100),
    Direccion VARCHAR(200),
    Ciudad VARCHAR(100),
    Provincia VARCHAR(100)
);"""

In [5]:
cursor.execute(tabla_proveedores)

In [6]:
tabla_categorias = '''
CREATE TABLE IF NOT EXISTS Categorias (
    CodigoCategoria INT PRIMARY KEY,
    Nombre VARCHAR(100)
);
'''

In [7]:
cursor.execute(tabla_categorias)

In [8]:
tabla_piezas = '''
CREATE TABLE IF NOT EXISTS Piezas (
    CodigoPieza INT PRIMARY KEY,
    Nombre VARCHAR(100),
    Color VARCHAR(50),
    Precio DECIMAL(10,2),
    CodigoCategoria INT,
    FOREIGN KEY (CodigoCategoria) REFERENCES Categorias(CodigoCategoria)
    );
'''

In [9]:
cursor.execute(tabla_piezas)

In [10]:
tabla_suministros = """
CREATE TABLE IF NOT EXISTS Suministros (
CodigoProveedor INT,
CodigoPieza INT,
Fecha DATE,
Cantidad INT,
PRIMARY KEY (CodigoProveedor, CodigoPieza, Fecha),
FOREIGN KEY (CodigoProveedor) REFERENCES Proveedores(CodigoProveedor),
FOREIGN KEY (CodigoPieza) REFERENCES Piezas(CodigoPieza)
);
"""

In [11]:
cursor.execute(tabla_suministros)

In [14]:
# Creo los datos de dos proveedores 

proveedor_1 = [(1, 'Proveedor Garcia', 'Calle Tramontana 88', 'Mahon', 'Baleares')]
proveedor_2 = [(2, 'Proveedor Perez', 'Calle Marina 56', 'CABA', 'Buenos Aires')]

In [13]:
# Preparo al proveedor para agregar en la tabla 
cursor.executemany("INSERT INTO Proveedores (CodigoProveedor, Nombre, Direccion, Ciudad, Provincia) VALUES (?,?,?,?,?)", proveedor_2)

IntegrityError: UNIQUE constraint failed: Proveedores.CodigoProveedor

In [15]:
# Confirmo la operacion con el commit. 
conexion.commit()

In [16]:
# Consulto si la base de datos tiene los objetos que agregue. 

cursor.execute("SELECT * FROM Proveedores")
proveedores = cursor.fetchall()

In [17]:
# Mostrar los datos
print("Proveedores registrados:")
for proveedor in proveedores:
    print(proveedor)

Proveedores registrados:
(1, 'Proveedor Garcia', 'Calle Tramontana 88', 'Mahon', 'Baleares')
(2, 'Proveedor Perez', 'Calle Marina 56', 'CABA', 'Buenos Aires')

In [18]:
# Agrego una categoria 
categoria_1 = [(1,"Electronica")]
categoria_2 = [(2,"Muebles")]

cursor.executemany("INSERT INTO Categorias (CodigoCategoria, Nombre) VALUES (?,?)", categoria_2)

In [19]:
cursor.execute("SELECT * FROM Categorias")
categorias = cursor.fetchall()

In [20]:
print("Categorias registradas:")
for categoria in categorias:
    print(categoria)

Categorias registradas:
(1, 'Electronica')
(2, 'Muebles')

In [21]:
# Agrego una pieza 
pieza1 = [(101, 'Resistor', 'Rojo', 0.5, 1)]
cursor.executemany("INSERT INTO Piezas (CodigoPieza, Nombre, Color, Precio, CodigoCategoria) VALUES (?,?,?,?,?)", pieza1)

IntegrityError: UNIQUE constraint failed: Piezas.CodigoPieza

In [22]:
cursor.execute("SELECT * FROM Piezas")
piezas = cursor.fetchall()

In [23]:
print("Piezas registradas:")
for pieza in piezas:
    print(pieza)

Piezas registradas:
(101, 'Resistor', 'Rojo', 0.5, 1)

In [24]:
# Agrego los datos del suministro para inventario. 
suministro1 = [(1, 101, '2024-12-01', 100)]

cursor.executemany("INSERT INTO Suministros (CodigoProveedor, CodigoPieza, Fecha, Cantidad) VALUES (?,?,?,?)", suministro1)

In [25]:
cursor.execute("SELECT * FROM Suministros")
suministros = cursor.fetchall()

In [26]:
print("Suministros registrados:")
for suministro in suministros:
    print(suministro)

Suministros registrados:
(1, 101, '2024-12-01', 100)

In [27]:

def sql_query(query):    
    cursor.execute(query) 
    ans = cursor.fetchall()
    names = [description[0] for description in cursor.description]
    return pd.DataFrame(ans,columns=names)

In [28]:
query = '''
SELECT * FROM Proveedores'''

sql_query(query)

   CodigoProveedor            Nombre            Direccion Ciudad     Provincia
0                1  Proveedor Garcia  Calle Tramontana 88  Mahon      Baleares
1                2   Proveedor Perez      Calle Marina 56   CABA  Buenos Aires

In [29]:
query = '''
SELECT * FROM Suministros'''

sql_query(query)

   CodigoProveedor  CodigoPieza       Fecha  Cantidad
0                1          101  2024-12-01       100

In [30]:
query = '''
SELECT * FROM Piezas'''

sql_query(query)

   CodigoPieza    Nombre Color  Precio  CodigoCategoria
0          101  Resistor  Rojo     0.5                1

In [31]:
query = '''
SELECT * FROM Categorias'''

sql_query(query)

   CodigoCategoria       Nombre
0                1  Electronica
1                2      Muebles

In [32]:
conexion.close()